## Terraform Plan Result
```
Acquiring state lock. This may take a few moments...
module.vpc.aws_vpc.vpc: Refreshing state... [id=vpc-09661fafb70912d59]
module.alb.aws_lb_listener.http: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:695394391597:listener/app/testapp-alb/730663846521c0b7/82c799fa5a33b240]
module.vpc.aws_internet_gateway.igw: Refreshing state... [id=igw-0c95584a0405eb305]
module.vpc.aws_subnet.public["public2"]: Refreshing state... [id=subnet-0bd25590b8c40e215]
module.vpc.aws_subnet.public["public1"]: Refreshing state... [id=subnet-0164d01ea3b2d32a6]
module.vpc.aws_subnet.private["private1"]: Refreshing state... [id=subnet-0b963af2aef71f3fb]
module.vpc.aws_subnet.private["private2"]: Refreshing state... [id=subnet-07bc02d4785e011d3]
module.security_group.aws_security_group.security_group["ec2_sg"]: Refreshing state... [id=sg-042bc95a55a671042]
module.security_group.aws_security_group.security_group["alb_sg"]: Refreshing state... [id=sg-03c8e261da2033d80]
module.alb.aws_lb_target_group.target_group: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:695394391597:targetgroup/testapp-tg/75eaec5e9e61b04f]
module.vpc.aws_route_table.public: Refreshing state... [id=rtb-072bf793e874d881a]
module.vpc.aws_route_table_association.public["public1"]: Refreshing state... [id=rtbassoc-0ad39972a8ac2d5b9]
module.vpc.aws_route_table_association.public["public2"]: Refreshing state... [id=rtbassoc-030a511f834b8ed6b]
aws_security_group_rule.alb_ingress: Refreshing state... [id=sgrule-1723469987]
aws_security_group_rule.ec2_egress: Refreshing state... [id=sgrule-2524424533]
aws_security_group_rule.allow_alb_to_ec2: Refreshing state... [id=sgrule-856666276]
module.alb.aws_lb.alb: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:695394391597:loadbalancer/app/testapp-alb/730663846521c0b7]
module.asg.aws_launch_template.lt: Refreshing state... [id=lt-0640409d35794e085]
module.asg.aws_autoscaling_group.asg: Refreshing state... [id=testapp-dev-asg]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # module.alb.aws_lb_listener.http will be destroyed
  # (because aws_lb_listener.http is not in configuration)
  - resource "aws_lb_listener" "http" {
      - arn                                                                 = "arn:aws:elasticloadbalancing:ap-northeast-1:695394391597:listener/app/testapp-alb/730663846521c0b7/82c799fa5a33b240" -> null
      - id                                                                  = "arn:aws:elasticloadbalancing:ap-northeast-1:695394391597:listener/app/testapp-alb/730663846521c0b7/82c799fa5a33b240" -> null
      - load_balancer_arn                                                   = "arn:aws:elasticloadbalancing:ap-northeast-1:695394391597:loadbalancer/app/testapp-alb/730663846521c0b7" -> null
      - port                                                                = 80 -> null
      - protocol                                                            = "HTTP" -> null
      - routing_http_response_server_enabled                                = true -> null
      - tags                                                                = {} -> null
      - tags_all                                                            = {} -> null
        # (11 unchanged attributes hidden)

      - default_action {
          - order            = 1 -> null
          - target_group_arn = "arn:aws:elasticloadbalancing:ap-northeast-1:695394391597:targetgroup/testapp-tg/75eaec5e9e61b04f" -> null
          - type             = "forward" -> null
        }
    }

  # module.alb.aws_lb_listener.http_redirect will be created
  + resource "aws_lb_listener" "http_redirect" {
      + arn                                                                   = (known after apply)
      + id                                                                    = (known after apply)
      + load_balancer_arn                                                     = "arn:aws:elasticloadbalancing:ap-northeast-1:695394391597:loadbalancer/app/testapp-alb/730663846521c0b7"
      + port                                                                  = 80
      + protocol                                                              = "HTTP"
      + routing_http_request_x_amzn_mtls_clientcert_header_name               = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_issuer_header_name        = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_leaf_header_name          = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_serial_number_header_name = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_subject_header_name       = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_validity_header_name      = (known after apply)
      + routing_http_request_x_amzn_tls_cipher_suite_header_name              = (known after apply)
      + routing_http_request_x_amzn_tls_version_header_name                   = (known after apply)
      + routing_http_response_access_control_allow_credentials_header_value   = (known after apply)
      + routing_http_response_access_control_allow_headers_header_value       = (known after apply)
      + routing_http_response_access_control_allow_methods_header_value       = (known after apply)
      + routing_http_response_access_control_allow_origin_header_value        = (known after apply)
      + routing_http_response_access_control_expose_headers_header_value      = (known after apply)
      + routing_http_response_access_control_max_age_header_value             = (known after apply)
      + routing_http_response_content_security_policy_header_value            = (known after apply)
      + routing_http_response_server_enabled                                  = (known after apply)
      + routing_http_response_strict_transport_security_header_value          = (known after apply)
      + routing_http_response_x_content_type_options_header_value             = (known after apply)
      + routing_http_response_x_frame_options_header_value                    = (known after apply)
      + ssl_policy                                                            = (known after apply)
      + tags_all                                                              = (known after apply)
      + tcp_idle_timeout_seconds                                              = (known after apply)

      + default_action {
          + order = (known after apply)
          + type  = "redirect"

          + redirect {
              + host        = "#{host}"
              + path        = "/#{path}"
              + port        = "443"
              + protocol    = "HTTPS"
              + query       = "#{query}"
              + status_code = "HTTP_301"
            }
        }

      + mutual_authentication (known after apply)
    }

  # module.alb.aws_lb_listener.https will be created
  + resource "aws_lb_listener" "https" {
      + arn                                                                   = (known after apply)
      + certificate_arn                                                       = (known after apply)
      + id                                                                    = (known after apply)
      + load_balancer_arn                                                     = "arn:aws:elasticloadbalancing:ap-northeast-1:695394391597:loadbalancer/app/testapp-alb/730663846521c0b7"
      + port                                                                  = 443
      + protocol                                                              = "HTTPS"
      + routing_http_request_x_amzn_mtls_clientcert_header_name               = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_issuer_header_name        = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_leaf_header_name          = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_serial_number_header_name = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_subject_header_name       = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_validity_header_name      = (known after apply)
      + routing_http_request_x_amzn_tls_cipher_suite_header_name              = (known after apply)
      + routing_http_request_x_amzn_tls_version_header_name                   = (known after apply)
      + routing_http_response_access_control_allow_credentials_header_value   = (known after apply)
      + routing_http_response_access_control_allow_headers_header_value       = (known after apply)
      + routing_http_response_access_control_allow_methods_header_value       = (known after apply)
      + routing_http_response_access_control_allow_origin_header_value        = (known after apply)
      + routing_http_response_access_control_expose_headers_header_value      = (known after apply)
      + routing_http_response_access_control_max_age_header_value             = (known after apply)
      + routing_http_response_content_security_policy_header_value            = (known after apply)
      + routing_http_response_server_enabled                                  = (known after apply)
      + routing_http_response_strict_transport_security_header_value          = (known after apply)
      + routing_http_response_x_content_type_options_header_value             = (known after apply)
      + routing_http_response_x_frame_options_header_value                    = (known after apply)
      + ssl_policy                                                            = "ELBSecurityPolicy-2016-08"
      + tags_all                                                              = (known after apply)
      + tcp_idle_timeout_seconds                                              = (known after apply)

      + default_action {
          + order            = (known after apply)
          + target_group_arn = "arn:aws:elasticloadbalancing:ap-northeast-1:695394391597:targetgroup/testapp-tg/75eaec5e9e61b04f"
          + type             = "forward"
        }

      + mutual_authentication (known after apply)
    }

  # module.networking.aws_acm_certificate.acm will be created
  + resource "aws_acm_certificate" "acm" {
      + arn                       = (known after apply)
      + domain_name               = "manno-coud.com"
      + domain_validation_options = [
          + {
              + domain_name           = "manno-coud.com"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + key_algorithm             = (known after apply)
      + not_after                 = (known after apply)
      + not_before                = (known after apply)
      + pending_renewal           = (known after apply)
      + renewal_eligibility       = (known after apply)
      + renewal_summary           = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = [
          + "manno-coud.com",
        ]
      + tags                      = {
          + "Name" = "testapp-dev-acm"
        }
      + tags_all                  = {
          + "Name" = "testapp-dev-acm"
        }
      + type                      = (known after apply)
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"

      + options (known after apply)
    }

  # module.networking.aws_acm_certificate_validation.cert_validation will be created
  + resource "aws_acm_certificate_validation" "cert_validation" {
      + certificate_arn         = (known after apply)
      + id                      = (known after apply)
      + validation_record_fqdns = (known after apply)
    }

  # module.networking.aws_route53_record.cert_validation["manno-coud.com"] will be created
  + resource "aws_route53_record" "cert_validation" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "Z0503722I9WYWDH7TZ72"
    }

  # module.networking.aws_route53_zone.main will be created
  + resource "aws_route53_zone" "main" {
      + arn                 = (known after apply)
      + comment             = "Managed by Terraform"
      + force_destroy       = false
      + id                  = (known after apply)
      + name                = "manno-coud.com"
      + name_servers        = (known after apply)
      + primary_name_server = (known after apply)
      + tags                = {
          + "Env"     = "dev"
          + "Name"    = "testapp-dev-zone"
          + "Project" = "testapp"
        }
      + tags_all            = {
          + "Env"     = "dev"
          + "Name"    = "testapp-dev-zone"
          + "Project" = "testapp"
        }
      + zone_id             = (known after apply)
    }

Plan: 6 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
<!-- Sticky Pull Request Commentterraform-plan -->